Revit 2024 API
FamilySizeTableManager.CreateFamilySizeTableManager Method
 Adds FamilySizeTableManager to a Family. A FamilySizeTableManager and FamilySizeTables are only needed when importing, exporting, or removing size data previously stored in CSV files.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool CreateFamilySizeTableManager(
	Document document,
	ElementId familyId
)
Visual Basic
Public Shared Function CreateFamilySizeTableManager ( _
	document As Document, _
	familyId As ElementId _
) As Boolean
Visual C++
public:
static bool CreateFamilySizeTableManager(
	Document^ document,
	ElementId^ familyId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 Family owned document or project document.
familyId
Type: Autodesk.Revit.DB.ElementId
 ElementId of the Family.
Return Value
 True if successful, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace